{
    "projects": [
      {
        "title": "Movie Service",
        "note": "Partnering on a dynamic full-stack project, I developed both a web application and an Android app for browsing and purchasing movies, leveraging Tomcat, JavaScript, Java, HTML5, CSS, and SQL. To integrate a robust movie database, I parsed Stanford Movies Database’s XML and DTD files, seamlessly incorporating over 1,000 movie entries while utilizing SQL and jQuery to efficiently sort and display data across web pages. To ensure scalability and reliability, I deployed the application on AWS EC2, providing a smooth and accessible user experience.<br><a href='https://www.youtube.com/watch?v=6OyD95aFS3c'>Link to Video of this project</a>",
        "skillsUsed": "Java, Javascript, RestAPI, TomCat, Maven, HTML, CSS, GitHub, Android Studio, SQL, XML, DTD, AWS E2",
        "link": "<a href='https://github.com/buimichelle/MovieService'>GitHub Link</a>"
      },
      {
        "title": "Web Crawler",
        "note": "hi",
        "skillsUsed": "Python, BeautifulSoup",
        "link": "0"
      },
      {
        "title": "Search Engine",
        "note": "hi",
        "whatIDid": "Created a simple search engine using web scraping techniques.",
        "skillsUsed": "Python, BeautifulSoup",
        "link": "0"
      },
      {
        "title": "PCOS-Answered",
        "note": "As a fellow for Girls Who Code Leadership Academy, I am tasked with making a project that gives back to the community. Because PCOS have affected people around me, I decided to knock two birds with one stone: learn more about PCOS and tackle on front-end engineering. It was one of my very first web application I have ever made so it was rough. Eventually I finished and submitted it, showcasing it at our end of the program virtual call. In addition, one of my friend found out about PCOS and got diagnosed, all thanks to my website. <br><a = href='http://github.com'>Github Link<a>",
        "skillsUsed": "Javascript, Node.js, HTML, CSS",
        "link": "pcos-answered.netlify.net"
      },
      {
        "title": "Michelle Bui's Portfolio",
        "note": "There was debate on whether I should use my skills in WIX or challenge myself once more with coding it. The coding won in the end. It took me a couple of days due to trying to find a good layout or what frameworks I wanted to use. I eventually chose to host my site off GitHub Pages.",
        "skillsUsed": "GitHub, HTML, CSS, Javascript, JSON",
        "link": "buimichelle.github.io"
      },
      {
        "title": "Minesweeper AI Project",
        "note": "hi",
        "skillsUsed": "Python, AI, Game Theory",
        "link": "0"
      },
      {
        "title": "Tic Tac Toe Application",
        "note": "This was my first Python Tkinter application. To play, you must be connected to each other host IP over a socket. It is one of my first CS Projects.",
        "skillsUsed": "Python, Tkinter",
        "link": "<a href='https://github.com/buimichelle/MovieService'>GitHub Link</a>"
      },
      {
        "title": "Process and Resource Management",
        "note": "hi",
        "whatIDid": "Simulated process scheduling and resource allocation in OS.",
        "skillsUsed": "C, Operating Systems",
        "link": "https://github.com/buimichelle/Process-and-Resource-Management"
      },
      {
        "title": "Virtual Memory with Demand Paging",
        "note": "hi",
        "whatIDid": "Simulated virtual memory with demand paging techniques.",
        "skillsUsed": "C, Operating Systems",
        "link": "https://github.com/buimichelle/virtualmemory"
      },
      {
        "title": "Bank Fundraiser",
        "note": "hi",
        "whatIDid": "Developed a fundraising management system for a bank.",
        "skillsUsed": "Java, SQL",
        "link": "http://example.com/bank-fundraiser"
      },
      {
        "title": "Bank Management",
        "note": "hi",
        "whatIDid": "Built a banking system for managing customer accounts.",
        "skillsUsed": "Java, SQL",
        "link": "http://example.com/bank-management"
      },
      {
        "title": "Food Calculator",
        "note": "hi",
        "whatIDid": "Created a nutrition calculator for food intake tracking.",
        "skillsUsed": "Python, Flask",
        "link": "http://example.com/food-calculator"
      },
      {
        "title": "Parking Lot Management",
        "note": "hi",
        "whatIDid": "Developed an automated parking lot management system.",
        "skillsUsed": "Java, MySQL",
        "link": "http://example.com/parking-lot-management"
      },
      {
        "title": "Sport Management",
        "note": "hi",
        "whatIDid": "Designed a sports event management application.",
        "skillsUsed": "Python, Django",
        "link": "http://example.com/sport-management"
      }
    ],
    "websites": [
      {
        "title": "deltalambdachi.org",
        "note": "My sorority originally had a website, but it was never maintained, and the domain eventually expired and was sold. The original domain, deltalambdachi.com, was lost. A new webmistress attempted to create a simple site using deltalambdachi.net, but it was never fully completed and eventually became inactive. When I was a new member, yet another webmistress was appointed, but she never finished or published the site before graduating. <br>Seeing the ongoing struggle, I took it upon myself to rebuild our website, as I had a passion for web design. Starting from scratch was incredibly challenging—I had no photos, no real experience, and felt immense pressure to make the site perfect to attract potential new members. Through countless trials and errors, I finally created a fully functional website. I chose Wix because of its accessibility, ensuring that future webmistresses could easily update and maintain it, regardless of their technical skills. <br>*Due to my graduation, website currently maintain by new webmistress!",
        "skillsUsed": "UI/UX Design, WIX, SEO",
        "link": "https://deltalambdachi.org"
      },
      {
        "title": "irvinemsfc.com",
        "note": "One of my duty of VP Of Communication was to maintain the website, but I honestly believe the website was a mess, outdated, and just not captatiing as the other council's sites are. I took it in my own heads to redesign the website and luckily, there was already many pictures uploaded by past chairs. I took the chance and redesign the website to make it modern, more informative, and attention-capturing. I worked with the Director of SFL and the VP Of Programming to make this website perfect. <br>*Due to end of term, website is maintain by my successor. ",
        "skillsUsed": "HTML, CSS, JavaScript",
        "link": "https://irvinemsfc.com"
      }
    ],
    "dataAnalytics": [
      {
        "title": "Fashion MNIST Classifier",
        "note": "hi",
        "whatIDid": "Built a machine learning model to classify clothing items from the Fashion MNIST dataset.",
        "skillsUsed": "Python, TensorFlow, Pandas",
        "link": "http://example.com/fashion-mnist"
      },
      {
        "title": "NYC Eviction",
        "note": "hi",
        "whatIDid": "Analyzed NYC eviction trends using public housing data.",
        "skillsUsed": "Python, Pandas, Data Visualization",
        "link": "http://example.com/nyc-eviction"
      },
      {
        "title": "Budget Allocation for Digital Marketing",
        "note": "hi",
        "whatIDid": "Optimized budget allocation for digital ads using historical ad data.",
        "skillsUsed": "Python, Pandas, Data Analysis",
        "link": "http://example.com/budget-allocation"
      }
    ]
  }
  
  